Revit 2015 API
ReinforcementSettings.DocumentContainsNoRebar Method
 Checks whether the document is free of Rebar elements. Only in this case it is allowed to change RebarShapeDefinesHooks property.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2013
Syntax
C#
public bool DocumentContainsNoRebar()
Visual Basic
Public Function DocumentContainsNoRebar As Boolean
Visual C++
public:
bool DocumentContainsNoRebar()
See Also
ReinforcementSettings Class
Autodesk.Revit.DB.Structure Namespace